In [1]:
from pandas import Series, DataFrame

In [2]:
import pandas as pd

In [3]:
import numpy as np

### Pandas 자료구조

#### 5.1.1 Series

Series는 일련의 객체를 담을 수 있는 1차원 배열 같은 구조

In [5]:
obj = Series([4,7,-5,3])

In [6]:
obj

0    4
1    7
2   -5
3    3
dtype: int64

In [7]:
obj.values # Series의 배열을 확인하는 명령어

array([ 4,  7, -5,  3], dtype=int64)

In [9]:
obj.index #Series의 인덱스의 상세를 확인하는 명령어

RangeIndex(start=0, stop=4, step=1)

In [10]:
obj2 = Series([4,7,-5,3], index = ['d','a','b','c'])

In [11]:
obj2

d    4
a    7
b   -5
c    3
dtype: int64

In [12]:
obj2.index

Index(['d', 'a', 'b', 'c'], dtype='object')

In [13]:
obj2['a'] # 마치 딕셔너리 자료형처럼 인덱스에 해당하는 배열 값을 반환한다.

7

In [14]:
obj2['b'] =6

In [15]:
obj2

d    4
a    7
b    6
c    3
dtype: int64

In [16]:
obj2[obj2 > 0] # 불리언 배열 사용해서 값을 걸러낼 수 있음.

d    4
a    7
b    6
c    3
dtype: int64

In [17]:
obj2*2

d     8
a    14
b    12
c     6
dtype: int64

In [20]:
np.exp(obj2)

d      54.598150
a    1096.633158
b     403.428793
c      20.085537
dtype: float64

In [21]:
'b' in obj2 # 고정 길이의 정렬된 사전형의 데이터라고 알면 된다.

True

In [22]:
sdata = {'Ohio' : 35000, 'Texas' : 71000, 'Oregon' : 16000, 'Utah' : 5000}

In [23]:
obj3 = Series(sdata)

In [24]:
obj3

Ohio      35000
Oregon    16000
Texas     71000
Utah       5000
dtype: int64

In [25]:
states = ['California','Ohio','Oregon','Texas']

In [26]:
obj4 = Series(sdata, index=states)

In [27]:
obj4

California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
dtype: float64

In [29]:
pd.isnull(obj4) # NA값을 찾아내는 명령어

California     True
Ohio          False
Oregon        False
Texas         False
dtype: bool

In [31]:
pd.notnull(obj4)

California    False
Ohio           True
Oregon         True
Texas          True
dtype: bool

In [32]:
obj3 + obj4 #두 배열을 Merge하는 법

California         NaN
Ohio           70000.0
Oregon         32000.0
Texas         142000.0
Utah               NaN
dtype: float64

In [33]:
obj4.name = 'population'

In [34]:
obj4.index.name = 'state'

In [35]:
obj4

state
California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
Name: population, dtype: float64

In [36]:
obj.index = ['Bob','Steve','Jeff','Ryan']

In [37]:
obj

Bob      4
Steve    7
Jeff    -5
Ryan     3
dtype: int64

#### 5.1.2 DataFrame

DataFrame은 표 같은 스프레드시트 형식의 자료 구조

여러 개의 칼럼에 서로 다른 종류의 값을 담을 수 있음.

In [38]:
data = {'state':['Ohio','Ohio','Ohio','Nevada','Nevada'],
       'year':[2000,2001,2002,2001,2002],
       'pop':[1.5,1.7,3.6,2.4,2.9]}

In [39]:
frame = DataFrame(data)

In [40]:
frame

   pop   state  year
0  1.5    Ohio  2000
1  1.7    Ohio  2001
2  3.6    Ohio  2002
3  2.4  Nevada  2001
4  2.9  Nevada  2002

In [41]:
DataFrame(data, columns=['year','state','pop'])

   year   state  pop
0  2000    Ohio  1.5
1  2001    Ohio  1.7
2  2002    Ohio  3.6
3  2001  Nevada  2.4
4  2002  Nevada  2.9

In [99]:
frame2 = DataFrame(data, columns=['year','state','pop','debt'],
                  index=['one','two','three','four','five'])

In [100]:
frame2

       year   state  pop debt
one    2000    Ohio  1.5  NaN
two    2001    Ohio  1.7  NaN
three  2002    Ohio  3.6  NaN
four   2001  Nevada  2.4  NaN
five   2002  Nevada  2.9  NaN

In [44]:
frame2.columns

Index(['year', 'state', 'pop', 'debt'], dtype='object')

In [45]:
frame2['state'] #DataFrame의 칼럼은 Series처럼 사전 형식 표기법이나 속성 형식으로 접근 가능하다.

one        Ohio
two        Ohio
three      Ohio
four     Nevada
five     Nevada
Name: state, dtype: object

In [46]:
frame2.year

one      2000
two      2001
three    2002
four     2001
five     2002
Name: year, dtype: int64

In [49]:
frame2.ix['three'] #로우는 위치나 ix같은 몇 가지 메서드 통해 접근 가능하다.

year     2002
state    Ohio
pop       3.6
debt      NaN
Name: three, dtype: object

In [50]:
frame2['debt'] = 16.5

In [51]:
frame2

       year   state  pop  debt
one    2000    Ohio  1.5  16.5
two    2001    Ohio  1.7  16.5
three  2002    Ohio  3.6  16.5
four   2001  Nevada  2.4  16.5
five   2002  Nevada  2.9  16.5

In [53]:
frame2['debt'] = np.arange(5.)

In [54]:
frame2

       year   state  pop  debt
one    2000    Ohio  1.5   0.0
two    2001    Ohio  1.7   1.0
three  2002    Ohio  3.6   2.0
four   2001  Nevada  2.4   3.0
five   2002  Nevada  2.9   4.0

In [55]:
val = Series([-1.2,-1.5,-1.7],index=['two','four','five'])

In [56]:
frame2['debt'] = val

In [57]:
frame2

       year   state  pop  debt
one    2000    Ohio  1.5   NaN
two    2001    Ohio  1.7  -1.2
three  2002    Ohio  3.6   NaN
four   2001  Nevada  2.4  -1.5
five   2002  Nevada  2.9  -1.7

판다스의 데이터프레임은 위와 같이 다른 Series 배열 객체의 인덱스에 해당하는 값들로 새로운 칼럼에 대해 값을 지정해도 같은 인덱스를 찾아서 그 인덱스에 값을 지정해준다.

In [58]:
frame2['eastern'] = frame2.state == 'Ohio'
# frame2에 eastern이라는 칼럼을 추가하는데,
#이 칼럼은 frame2.state가 뒤의 조건탐색문 '=='에 해당하는 값과 같은지의 여부를 다룬 불리언 값을 저장한다.

In [59]:
frame2

       year   state  pop  debt  eastern
one    2000    Ohio  1.5   NaN     True
two    2001    Ohio  1.7  -1.2     True
three  2002    Ohio  3.6   NaN     True
four   2001  Nevada  2.4  -1.5    False
five   2002  Nevada  2.9  -1.7    False

In [60]:
#칼럼 삭제는 del 키를 활용한다.

In [61]:
del frame2['eastern']

In [62]:
frame2

       year   state  pop  debt
one    2000    Ohio  1.5   NaN
two    2001    Ohio  1.7  -1.2
three  2002    Ohio  3.6   NaN
four   2001  Nevada  2.4  -1.5
five   2002  Nevada  2.9  -1.7

In [63]:
frame2.columns

Index(['year', 'state', 'pop', 'debt'], dtype='object')

In [65]:
pop = {'Nevada' : {2001 : 2.4, 2002 : 2.9},
      'Ohio' : {2000 : 1.5, 2001 : 1.7, 2002:3.6}} #네스티드 딕셔너리 구조

In [66]:
frame3=DataFrame(pop)

In [67]:
frame3

      Nevada  Ohio
2000     NaN   1.5
2001     2.4   1.7
2002     2.9   3.6

In [68]:
frame3.T # 행렬전환

        2000  2001  2002
Nevada   NaN   2.4   2.9
Ohio     1.5   1.7   3.6

In [69]:
DataFrame(pop, index=[2001,2002,2003])

      Nevada  Ohio
2001     2.4   1.7
2002     2.9   3.6
2003     NaN   NaN

In [70]:
pdata = {'Ohio' : frame3['Ohio'][:-1],
        'Nevada' : frame3['Nevada'][:2]}

In [71]:
pdata

{'Nevada': 2000    NaN
 2001    2.4
 Name: Nevada, dtype: float64, 'Ohio': 2000    1.5
 2001    1.7
 Name: Ohio, dtype: float64}

In [72]:
type(pdata)

dict

In [73]:
DataFrame(pdata)

      Nevada  Ohio
2000     NaN   1.5
2001     2.4   1.7

In [77]:
frame3

      Nevada  Ohio
2000     NaN   1.5
2001     2.4   1.7
2002     2.9   3.6

In [78]:
frame3.values

array([[ nan,  1.5],
       [ 2.4,  1.7],
       [ 2.9,  3.6]])

In [79]:
frame2.values

array([[2000, 'Ohio', 1.5, nan],
       [2001, 'Ohio', 1.7, -1.2],
       [2002, 'Ohio', 3.6, nan],
       [2001, 'Nevada', 2.4, -1.5],
       [2002, 'Nevada', 2.9, -1.7]], dtype=object)

#### 5.1.3 색인 객체

로우와 칼럼에 대한 이름, 축 이름 등을 저장하는 객체.

In [80]:
obj = Series(range(3), index=['a','b','c'])

In [84]:
index = obj.index #obj라는 시리즈 데이터의 인덱스로 구성된 배열 객체

In [82]:
index

Index(['a', 'b', 'c'], dtype='object')

In [83]:
index[1:]

Index(['b', 'c'], dtype='object')

In [85]:
index[1:] = 'd'

TypeError: Index does not support mutable operations

In [86]:
# 색인 객체는 변경이 불가능함

In [87]:
# 이처럼 변경 불가이므로 자료 구조 사이에서 안전히 공유 가능하다.

In [88]:
index = pd.Index(np.arange(3))

In [89]:
obj2 = Series([1.5,-2.5,0], index=index)

In [90]:
obj2.index is index

True

In [91]:
obj

a    0
b    1
c    2
dtype: int32

In [92]:
obj2

0    1.5
1   -2.5
2    0.0
dtype: float64

In [93]:
'Ohio' in frame3.columns

True

In [94]:
2003 in frame3.index

False

In [101]:
jaryo = {'명령어':['append','diff','intersection','union','isin','delete','drop','insert','is_monotonic','is_unique','unique'],
         '설명' : ['추가적인 Index 객체를 덧붙여 새로운 색인을 반환한다','색인의 차집합을 보여줌','색인의 교집합을 반환함',
                 '색인의 합집합을 반환함','넘겨받은 값이 해당 색인 위치에 존재하는지 알려주는\n불리언 배열을 반환함',
                 'i 위치의 색인이 삭제된 새로운 색인을 반환함','넘겨받은 값이 삭제된 새로운 색인을 반환한다.','i위치에 값이 추가된 새로운 색인을 반환한다.',
                 '색인이 단조성을 가진다면 True를 반환한다.','중복되는 색인이 없다면 True를 반환한다',
                 '색인에서 중복되는 요소를 제거하고 유일한 값만을 반환한다']}

In [102]:
pd.DataFrame(jaryo)

             명령어                                         설명
0         append            추가적인 Index 객체를 덧붙여 새로운 색인을 반환한다
1           diff                               색인의 차집합을 보여줌
2   intersection                               색인의 교집합을 반환함
3          union                               색인의 합집합을 반환함
4           isin  넘겨받은 값이 해당 색인 위치에 존재하는지 알려주는\n불리언 배열을 반환함
5         delete                  i 위치의 색인이 삭제된 새로운 색인을 반환함
6           drop                  넘겨받은 값이 삭제된 새로운 색인을 반환한다.
7         insert                  i위치에 값이 추가된 새로운 색인을 반환한다.
8   is_monotonic                  색인이 단조성을 가진다면 True를 반환한다.
9      is_unique                    중복되는 색인이 없다면 True를 반환한다
10        unique            색인에서 중복되는 요소를 제거하고 유일한 값만을 반환한다

#### 5.2 핵심기능

#### 5.2.1 재색인

In [103]:
obj = Series([4.5,7.2,-5.3,3.6],index=['d','a','b','c'])

In [104]:
obj

d    4.5
a    7.2
b   -5.3
c    3.6
dtype: float64

In [105]:
obj.reindex(['a','b','c','d','e'], fill_value=0)

a    7.2
b   -5.3
c    3.6
d    4.5
e    0.0
dtype: float64

reindex 메서드는 새로운 색인에 맞도록 객체를 새로 생성하는 기능이다.

In [106]:
obj3 = Series(['blue','purple','yellow'],index=[0,2,4])

In [107]:
obj3.reindex(range(6), method='ffill')

0      blue
1      blue
2    purple
3    purple
4    yellow
5    yellow
dtype: object

In [108]:
#시계열같은 순차 데이터 재색인 시 값 보관하거나 채워넣어야 할 경우에 활용.
#method 옵션 활용해 ffill 메서드로 앞의 값으로 누락된 값을 채워 넣을 수 있음

In [109]:
#ffill / pad - 앞의 값으로 채워 넣는다.
#bfill / backfill - 뒤의 값으로 채워 넣는다.

In [135]:
frame = DataFrame(np.arange(9).reshape((3,3)), index=['a','c','d'],
                 columns=['Ohio','Texas','California'])

In [112]:
frame

   Ohio  Texas  California
a     0      1           2
c     3      4           5
b     6      7           8

In [113]:
frame2 = frame.reindex(['a','b','c','d'])

In [124]:
frame2

   Ohio  Texas  California
a   0.0    1.0         2.0
b   6.0    7.0         8.0
c   3.0    4.0         5.0
d   NaN    NaN         NaN

In [141]:
states = ['Texas','Utah','California']

In [143]:
frame = frame.reindex(columns=states)

In [144]:
frame.reindex(index=['a','b','c','d'], method='ffill',columns=states)

   Texas  Utah  California
a      1   NaN           2
b      1   NaN           2
c      4   NaN           5
d      7   NaN           8

In [145]:
frame.ix[['a','b','c','d'],states]

C:\ProgramData\Anaconda3\lib\site-packages\ipykernel_launcher.py:1: DeprecationWarning:
.ix is deprecated. Please use
.loc for label based indexing or
.iloc for positional indexing

See the documentation here:
http://pandas.pydata.org/pandas-docs/stable/indexing.html#ix-indexer-is-deprecated
  """Entry point for launching an IPython kernel.

   Texas  Utah  California
a    1.0   NaN         2.0
b    NaN   NaN         NaN
c    4.0   NaN         5.0
d    7.0   NaN         8.0

#### 5.2.2 하나의 로우 또는 칼럼 삭제하기

In [146]:
obj = Series(np.arange(5.), index=['a','b','c','d','e'])

In [147]:
new_obj = obj.drop('c')

In [148]:
new_obj

a    0.0
b    1.0
d    3.0
e    4.0
dtype: float64

In [149]:
obj.drop(['d','c'])

a    0.0
b    1.0
e    4.0
dtype: float64

In [152]:
data= DataFrame(np.arange(16).reshape((4,4)),index=['Ohio','Colorado','Utah','New York'],
               columns = ['one','two','three','four'])

In [156]:
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [154]:
data.drop(['Colorado','Ohio']) #.drop 메서드는 해당 레코드를 제외한 나머지 레코드를 보여준다.

          one  two  three  four
Utah        8    9     10    11
New York   12   13     14    15

In [158]:
data.drop(['two','three'], axis=1)

          one  four
Ohio        0     3
Colorado    4     7
Utah        8    11
New York   12    15

#### 5.2.3 색인하기, 선택하기, 거르기

In [159]:
obj = Series(np.arange(4.), index=['a','b','c','d'])

In [167]:
obj

a    0.0
b    1.0
c    2.0
d    3.0
dtype: float64

In [160]:
obj['b']

1.0

In [161]:
obj[1]

1.0

In [162]:
obj[2:4]

c    2.0
d    3.0
dtype: float64

In [164]:
obj[['b','a','d']]

b    1.0
a    0.0
d    3.0
dtype: float64

In [165]:
obj[[1,3]]

b    1.0
d    3.0
dtype: float64

In [166]:
obj[obj<2]

a    0.0
b    1.0
dtype: float64

In [168]:
#라벨 이름으로 슬라이싱 하기

In [170]:
obj['b':'c'] #기존의 리스트 자료형에서 끝점은 포함하지 않았지만, 이 라벨 이름으로 슬라이싱하는 방법은 시작점과 끝점 모두를 포함한다.

b    1.0
c    2.0
dtype: float64

In [171]:
obj['b':'c'] = 5

In [172]:
obj

a    0.0
b    5.0
c    5.0
d    3.0
dtype: float64

In [173]:
data = DataFrame(np.arange(16).reshape((4,4)),index=['Ohio','Colorado','Utah','New York'],
               columns = ['one','two','three','four'])

In [174]:
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [175]:
data['two']

Ohio         1
Colorado     5
Utah         9
New York    13
Name: two, dtype: int32

In [176]:
data[['two','three']] #이렇게 다중의 컬럼으로 호출하는 것도 가능하다.

          two  three
Ohio        1      2
Colorado    5      6
Utah        9     10
New York   13     14

In [177]:
data[:2] # 슬라이싱으로 로우 선택가능

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7

In [178]:
data[data['three']>5] # 컬럼에 조건을 걸어 로우(레코드)를 필터링할 수 있음.

          one  two  three  four
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [179]:
data.ix['Colorado',['two','three']]

C:\ProgramData\Anaconda3\lib\site-packages\ipykernel_launcher.py:1: DeprecationWarning:
.ix is deprecated. Please use
.loc for label based indexing or
.iloc for positional indexing

See the documentation here:
http://pandas.pydata.org/pandas-docs/stable/indexing.html#ix-indexer-is-deprecated
  """Entry point for launching an IPython kernel.

two      5
three    6
Name: Colorado, dtype: int32

In [181]:
data.ix[['Colorado','Utah'],[3,0,1]] # 콜로라도와 유타라는 로우의 4번째, 1번째, 2번째 컬럼의 레코드값을 호출하겠다

          four  one  two
Colorado     7    4    5
Utah        11    8    9

In [182]:
data.ix[2]

one       8
two       9
three    10
four     11
Name: Utah, dtype: int32

In [183]:
data.ix[:'Utah','two'] # Utah라는 로우까지 컬럼 two 값을 호출한다

Ohio        1
Colorado    5
Utah        9
Name: two, dtype: int32

In [184]:
data.ix[data.three>5, :3] # three의 레코드 값이 5보다 높은 로우 중 첫번째부터 세번째 까지의 컬럼에 해당하는 레코드 값을 호출한다.

          one  two  three
Colorado    4    5      6
Utah        8    9     10
New York   12   13     14

In [190]:
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

#### 5.2.4 산술연산과 데이터 정렬

색인이 다른 객체 간의 산술연산이 가능하다. 객체를 더할 때 짝이 맞지 않는 색인이 있다면 결과에 두 색인이 통합된다.

In [191]:
s1 = Series([7.3,-2.5,3.4,1.5],index=['a','c','d','e'])
s2 = Series([-2.1,3.6,-1.5,4,3.1], index=['a','c','e','f','g'])

In [192]:
s1

a    7.3
c   -2.5
d    3.4
e    1.5
dtype: float64

In [193]:
s2

a   -2.1
c    3.6
e   -1.5
f    4.0
g    3.1
dtype: float64

In [194]:
s1+s2 # 같은 인덱스에 해당하는 로우 값들은 더해주고, 서로 공유하지 않는 인덱스의 로우 값들은 Null 값으로 대체된다.

a    5.2
c    1.1
d    NaN
e    0.0
f    NaN
g    NaN
dtype: float64

In [195]:
df1 = DataFrame(np.arange(9.).reshape((3,3)), columns=list('bcd'),index=['Ohio','Texas','Colorado'])
df2 = DataFrame(np.arange(12,).reshape((4,3)), columns=list('bde'),index=['Utah','Ohio','Texas','Oregon'])

In [196]:
df1

            b    c    d
Ohio      0.0  1.0  2.0
Texas     3.0  4.0  5.0
Colorado  6.0  7.0  8.0

In [197]:
df2

        b   d   e
Utah    0   1   2
Ohio    3   4   5
Texas   6   7   8
Oregon  9  10  11

In [199]:
df1 + df2 #데이터프레임 자료형 데이터도 위의 시리즈 자료형 데이터의 연산처럼 공유하지 않는 로우, 그리고 인덱스 값들은 NULL 값 처리가 된다.

            b   c     d   e
Colorado  NaN NaN   NaN NaN
Ohio      3.0 NaN   6.0 NaN
Oregon    NaN NaN   NaN NaN
Texas     9.0 NaN  12.0 NaN
Utah      NaN NaN   NaN NaN

In [200]:
df1 = DataFrame(np.arange(12.).reshape((3,4)), columns=list('abcd'))
df2 = DataFrame(np.arange(20,).reshape((4,5)), columns=list('abcde'))

In [201]:
df1

     a    b     c     d
0  0.0  1.0   2.0   3.0
1  4.0  5.0   6.0   7.0
2  8.0  9.0  10.0  11.0

In [202]:
df2

    a   b   c   d   e
0   0   1   2   3   4
1   5   6   7   8   9
2  10  11  12  13  14
3  15  16  17  18  19

In [203]:
df1 + df2

      a     b     c     d   e
0   0.0   2.0   4.0   6.0 NaN
1   9.0  11.0  13.0  15.0 NaN
2  18.0  20.0  22.0  24.0 NaN
3   NaN   NaN   NaN   NaN NaN

In [204]:
df1.add(df2, fill_value=0) #add 메서드를 활용해 df2와 fill_value 값을 인자로 전달한다.
#df2를 기반으로 df1의 레코드 값들과 합을 구하고, 서로 공유하지 않는 로우와 컬럼의 값을 채워넣는다.-df2기반으로-

      a     b     c     d     e
0   0.0   2.0   4.0   6.0   4.0
1   9.0  11.0  13.0  15.0   9.0
2  18.0  20.0  22.0  24.0  14.0
3  15.0  16.0  17.0  18.0  19.0

In [205]:
df1

     a    b     c     d
0  0.0  1.0   2.0   3.0
1  4.0  5.0   6.0   7.0
2  8.0  9.0  10.0  11.0

In [206]:
df2

    a   b   c   d   e
0   0   1   2   3   4
1   5   6   7   8   9
2  10  11  12  13  14
3  15  16  17  18  19

In [208]:
df1.reindex(columns=df2.columns, fill_value=0) #df1을 재색인하는데, columns는 df2의 컬럼으로 채우고, 해당 컬럼에 값이 없으면 0으로 채운다는 뜻이다.

     a    b     c     d  e
0  0.0  1.0   2.0   3.0  0
1  4.0  5.0   6.0   7.0  0
2  8.0  9.0  10.0  11.0  0

#### DataFrame과 Series 간의 연산

In [209]:
arr = np.arange(12.).reshape((3,4))

In [210]:
arr

array([[  0.,   1.,   2.,   3.],
       [  4.,   5.,   6.,   7.],
       [  8.,   9.,  10.,  11.]])

In [211]:
arr[0]

array([ 0.,  1.,  2.,  3.])

In [213]:
arr - arr[0] # 값이 브로드캐스팅으로 동시에 적용되는 것을 볼 수 있다.

array([[ 0.,  0.,  0.,  0.],
       [ 4.,  4.,  4.,  4.],
       [ 8.,  8.,  8.,  8.]])

In [214]:
frame = DataFrame(np.arange(12.).reshape((4,3)), columns=list('bde'),
                 index=['Utah','Ohio','Texas','Oregon'])

In [215]:
series = frame.ix[0]

C:\ProgramData\Anaconda3\lib\site-packages\ipykernel_launcher.py:1: DeprecationWarning:
.ix is deprecated. Please use
.loc for label based indexing or
.iloc for positional indexing

See the documentation here:
http://pandas.pydata.org/pandas-docs/stable/indexing.html#ix-indexer-is-deprecated
  """Entry point for launching an IPython kernel.

In [221]:
frame

          b     d     e
Utah    0.0   1.0   2.0
Ohio    3.0   4.0   5.0
Texas   6.0   7.0   8.0
Oregon  9.0  10.0  11.0

In [217]:
series

b    0.0
d    1.0
e    2.0
Name: Utah, dtype: float64

In [218]:
frame - series

          b    d    e
Utah    0.0  0.0  0.0
Ohio    3.0  3.0  3.0
Texas   6.0  6.0  6.0
Oregon  9.0  9.0  9.0

앞선 numpy의 배열의 예시처럼, DataFrame과 Series의 연산은 Series의 색인을 DataFrame의 칼럼에 맞춰 로우로 전파한다.

In [219]:
series2 = Series(range(3), index=['b','e','f'])

In [222]:
series2

b    0
e    1
f    2
dtype: int32

In [220]:
frame + series2

          b   d     e   f
Utah    0.0 NaN   3.0 NaN
Ohio    3.0 NaN   6.0 NaN
Texas   6.0 NaN   9.0 NaN
Oregon  9.0 NaN  12.0 NaN

In [223]:
series3 = frame['d']

In [224]:
frame

          b     d     e
Utah    0.0   1.0   2.0
Ohio    3.0   4.0   5.0
Texas   6.0   7.0   8.0
Oregon  9.0  10.0  11.0

In [225]:
series3

Utah       1.0
Ohio       4.0
Texas      7.0
Oregon    10.0
Name: d, dtype: float64

In [226]:
frame + series3

        Ohio  Oregon  Texas  Utah   b   d   e
Utah     NaN     NaN    NaN   NaN NaN NaN NaN
Ohio     NaN     NaN    NaN   NaN NaN NaN NaN
Texas    NaN     NaN    NaN   NaN NaN NaN NaN
Oregon   NaN     NaN    NaN   NaN NaN NaN NaN

In [227]:
frame.sub(series3, axis=0) # axis 값은 연산을 적용할 축 번호. axis=0은 DataFrame의 로우를 따라 연산을 수행하라는 의미다.

          b    d    e
Utah   -1.0  0.0  1.0
Ohio   -1.0  0.0  1.0
Texas  -1.0  0.0  1.0
Oregon -1.0  0.0  1.0

#### 5.2.5 함수 적용과 매핑

In [4]:
#Pandas 객체에 대한 Numpy의 유니버설 함수 활용

In [5]:
frame = DataFrame(np.random.randn(4,3), columns=list('bde'),index = ['Utah','Ohio','Texas','Oregon'])

In [6]:
frame

               b         d         e
Utah    0.257866  1.150217 -1.435105
Ohio    0.016468  0.496560  1.093473
Texas   0.228490  0.464836 -1.706631
Oregon -0.138191 -0.458837 -1.182095

In [7]:
np.abs(frame)

               b         d         e
Utah    0.257866  1.150217  1.435105
Ohio    0.016468  0.496560  1.093473
Texas   0.228490  0.464836  1.706631
Oregon  0.138191  0.458837  1.182095

In [8]:
f = lambda x: x.max() - x.min() # lambda는 인자에 대한 수학적 결과를 내놓는 함수다.

In [10]:
frame.apply(f)

b    0.396057
d    1.609053
e    2.800104
dtype: float64

In [11]:
frame.apply(f, axis=1)

Utah      2.585321
Ohio      1.077005
Texas     2.171467
Oregon    1.043903
dtype: float64

In [12]:
def f(x):
    return Series([x.min(), x.max()], index = ['min','max'])

In [13]:
frame.apply(f)

            b         d         e
min -0.138191 -0.458837 -1.706631
max  0.257866  1.150217  1.093473

In [14]:
format = lambda x:'%.2f' % x

In [15]:
frame.applymap(format)

            b      d      e
Utah     0.26   1.15  -1.44
Ohio     0.02   0.50   1.09
Texas    0.23   0.46  -1.71
Oregon  -0.14  -0.46  -1.18

In [16]:
frame['e'].map(format)

Utah      -1.44
Ohio       1.09
Texas     -1.71
Oregon    -1.18
Name: e, dtype: object

#### 5.2.6 정렬과 순위

In [17]:
obj = Series(range(4), index=['d','a','b','c'])

In [18]:
obj.sort_index() #로우, 칼럼의 색인을 알파벳 순으로 정렬하는 메서드 sort_index()

a    1
b    2
c    3
d    0
dtype: int32

In [19]:
frame = DataFrame(np.arange(8).reshape((2,4)), index=['three','one'], columns=['d','a','b','c'])

In [20]:
frame.sort_index()

       d  a  b  c
one    4  5  6  7
three  0  1  2  3

In [21]:
frame.sort_index(axis=1)

       a  b  c  d
three  1  2  3  0
one    5  6  7  4

In [22]:
frame.sort_index(axis = 1, ascending=False)

       d  c  b  a
three  0  3  2  1
one    4  7  6  5

In [23]:
obj = Series([4,7,-3,2])

In [24]:
obj.sort_values()

2   -3
3    2
0    4
1    7
dtype: int64

In [25]:
obj = Series([4, np.nan, 7, np.nan, -3,2])

In [26]:
obj.sort_values()

4   -3.0
5    2.0
0    4.0
2    7.0
1    NaN
3    NaN
dtype: float64

In [27]:
frame = DataFrame({'b':[4,7,-3,2], 'a':[0,1,0,1]})

In [28]:
frame

   a  b
0  0  4
1  1  7
2  0 -3
3  1  2

In [29]:
frame.sort_values(by='b')

   a  b
2  0 -3
3  1  2
0  0  4
1  1  7

In [30]:
frame.sort_values(by=['a','b'])

   a  b
2  0 -3
0  0  4
3  1  2
1  1  7

In [31]:
obj = Series([7,-5,7,4,2,0,4])

In [32]:
obj.rank() # rank 메서드는 동점인 항목에 대해서 평균 순위를 매긴다.

0    6.5
1    1.0
2    6.5
3    4.5
4    3.0
5    2.0
6    4.5
dtype: float64

In [33]:
obj.rank(method='first') #데이터 상에서 나타나는 순서에 따라(음수부터 양수로) 순위를 매길 수도 있다.

0    6.0
1    1.0
2    7.0
3    4.0
4    3.0
5    2.0
6    5.0
dtype: float64

In [34]:
obj.rank(ascending=False, method='max') #내림차순으로 순위 매기기

0    2.0
1    7.0
2    2.0
3    4.0
4    5.0
5    6.0
6    4.0
dtype: float64

In [37]:
frame = DataFrame({'b' : [4.3,7,-3,2],
                  'a': [0,1,0,1],
                  'c': [-2,5,8,-2.5]})

In [38]:
frame

   a    b    c
0  0  4.3 -2.0
1  1  7.0  5.0
2  0 -3.0  8.0
3  1  2.0 -2.5

In [39]:
frame.rank(axis=1) #로우별로 레코드값에 대한 순서를 매김.

     a    b    c
0  2.0  3.0  1.0
1  1.0  3.0  2.0
2  2.0  1.0  3.0
3  2.0  3.0  1.0

In [40]:
#average - 기본 값. 같은 값을 가지는 항목의 평균 값을 순위로 삼는다.
#min - 같은 값을 가지는 그룹을 낮은 순위로 매긴다.
#max - 같은 값을 가지는 그룹을 높은 순위로 매긴다.
#first - 데이터 내에서 위치에 따라 순위를 매긴다.

#### 5.2.7 중복 색인

In [5]:
obj = Series(range(5), index=['a','a','b','b','c'])

In [6]:
obj

a    0
a    1
b    2
b    3
c    4
dtype: int32

In [7]:
obj.index.is_unique

False

In [8]:
obj['a'] # 인덱스가 중복될 시에는 중복된 인덱스 Series 객체를 반환한다.

a    0
a    1
dtype: int32

In [9]:
obj['c'] # 아닌 경우에는 스칼라 값을 반환한다.

4

In [10]:
df = DataFrame(np.random.randn(4,3), index=['a','a','b','b'])

In [11]:
df

          0         1         2
a -1.159566  0.701051 -1.310765
a  1.104342 -0.716416  0.126029
b  0.430966 -0.222571  0.134352
b -0.134874  1.594959 -0.533634

In [12]:
df.ix['b']

C:\ProgramData\Anaconda3\lib\site-packages\ipykernel_launcher.py:1: DeprecationWarning:
.ix is deprecated. Please use
.loc for label based indexing or
.iloc for positional indexing

See the documentation here:
http://pandas.pydata.org/pandas-docs/stable/indexing.html#deprecate_ix
  """Entry point for launching an IPython kernel.

          0         1         2
b  0.430966 -0.222571  0.134352
b -0.134874  1.594959 -0.533634

#### 5.3 기술통계 계산과 요약

Pandas는 기본적인 수학 계산과 통계 처리를 할 수 있는 기능을 제공하고 있다. Numpy 배열과 비교했을 때, Pandas는 NA(누락된 데이터)는 제외하도록 설계되어 있다.

In [13]:
df = DataFrame([[1.4,np.nan],[7.1,-4.5],[np.nan,np.nan],[0.75,-1.3]],index=['a','b','c','d'],columns=['one','two'])

In [14]:
df

    one  two
a  1.40  NaN
b  7.10 -4.5
c   NaN  NaN
d  0.75 -1.3

In [15]:
df.sum()

one    9.25
two   -5.80
dtype: float64

In [23]:
df.sum(axis=1) #axis=1 옵션을 남기면 로우별 레코드값을 합산한 결과를 내놓는다. axis=1는 로우별 연산이고, 1은 칼럼별 연산이다.

a    1.40
b    2.60
c    0.00
d   -0.55
dtype: float64

In [20]:
df.mean(axis=1, skipna=False) # skipna는 누락된 값을 무시하겠느냐 아니겠느냐를 결정하는 메서드다. 여기서는 False이므로 포함해서 연산을 진행한다.

a      NaN
b    1.300
c      NaN
d   -0.275
dtype: float64

In [25]:
#level : 계산하려는 축이 계층적 색인(다중 색인)이라면 레벨에 따라 묶어서 계산한다.
#idxmin 이나 idxmax같은 메서드는 최소, 최대 값을 가지고 있는 색인 값 같은 간접 통계를 반환한다.

In [26]:
df.idxmax()

one    b
two    d
dtype: object

In [27]:
df.idxmin()

one    d
two    b
dtype: object

In [29]:
df.cumsum() #cumsum 메서드는 누산으로, 로우별로 누산한 결과를 내놓는다.

    one  two
a  1.40  NaN
b  8.50 -4.5
c   NaN  NaN
d  9.25 -5.8

In [30]:
df.describe()

            one       two
count  3.000000  2.000000
mean   3.083333 -2.900000
std    3.493685  2.262742
min    0.750000 -4.500000
25%    1.075000 -3.700000
50%    1.400000 -2.900000
75%    4.250000 -2.100000
max    7.100000 -1.300000

describe 메서드는 해당 테이블에 대해서 간단한 기술 통계치들을 보여준다.

In [31]:
obj = Series(['a','a','b','c']*4)

In [33]:
obj

0     a
1     a
2     b
3     c
4     a
5     a
6     b
7     c
8     a
9     a
10    b
11    c
12    a
13    a
14    b
15    c
dtype: object

In [34]:
obj.describe() #수치 데이터가 아니면 다른 기술통계를 보여준다.

count     16
unique     3
top        a
freq       8
dtype: object

다음은 기술통계와 요약통계 관련 메서드를 정리했다.

###### count = NA값 제외한 값의 수를 반환
###### describe =  테이블, 시리즈 데이터에 대한 요약통계 계산
###### min, max = 최소, 최대값
###### argmin, argmax = 최소, 최대값이 있는 색인의 위치를 반환
###### idxmin,idxmax = 최소, 최대 값을 가진 색인 값을 반환
###### quantile = 0부터 1까지의 분위수 계산
###### sum / mean / median = 합계 / 평균 / 중간값
###### mad = 평균 값에서 절대 평균편차를 구한다.
###### var = 표본의 분산 값을 구한다.
###### std = 표본의 정규 분산 값을 구한다.
###### skew = 표본의 비대칭도(왜도) 값을 구함.
###### kurt = 표본의 첨도 값을 구함.
###### cumsum = 누적 합산
###### cummin / cummax = 누적 최소값과 누적 최대값을 계산
###### cumprod = 누적 곱을 구함
###### diff = 1차 산술 차를 구한다.
###### pct_change = 퍼센트 변화율을 구한다.

#### 5.3.1 상관관계와 공분산

상관관계와 공분산 통계 게산을 위해서는 인자가 두 벌 필요하다.

In [37]:
import pandas_datareader as pdr

In [ ]:
all_data = {}
for ticker in ['AAPL','IBM','MSFT','GOOG']:
    all_data[ticker] = pdr.DataReader(ticker, 'google','2015-01-01','2016-01-01')

In [43]:
#위의 데이터는 AAPL, IBM, MSFT, GOOG라는 각각의 기업 데이터에 대해서 all_data에 딕셔너리 데이터 형태로 데이터를 읽게 하는 것이다.
#먼저 ticker라는 인자를 통해 개별 인자를 받고, 두번째에서 해당 데이터를 특징짓는 단어 'google'을 통해 그 데이터를 불러오고
#세번째로는 그 기간들을 명시해준다.(물론 여기서는 '기간'이라는 인자로 받은 것이 아니라, 그저 명시했다는 것이라고 생각한다.)

In [40]:
price = pd.DataFrame({tic: data['Close'] for tic, data in all_data.items()})
volume = pd.DataFrame({tic: data['Volume'] for tic, data in all_data.items()})

In [60]:
volume

                AAPL     GOOG       IBM      MSFT
Date
2016-11-21  29264571  1330639   4637097  19652595
2016-11-22  25965534  1593108   2770789  23206700
2016-11-23  27426394  1478417   2256165  21848913
2016-11-25  11475922   587421   1605344   8409616
2016-11-28  27193983  2188151   4449355  20732619
2016-11-29  28528750  1616618   3148196  22366721
2016-11-30  36162258  2392890   4397817  34655435
2016-12-01  37086862  3017947   4635665  34542121
2016-12-02  26527997  1452484   2740867  25515665
2016-12-05  34324540  1394223   3447052  23552658
2016-12-06  26195462  1690689   2858962  19907035
2016-12-07  29998719  1760966   4435050  30808969
2016-12-08  27068316  1488059   3266436  21220753
2016-12-09  34402627  1821914   3146930  27349356
2016-12-12  26374377  2104117   3392331  20198081
2016-12-13  43733811  2145209   5932271  35718868
2016-12-14  34031834  1704150   4124161  30352654
2016-12-15  46524544  1626499   3388570  27669868
2016-12-16  44351134  2443796   7120572  42453083
2016-12-19  27779423  1232087   2955906  34338219
2016-12-20  21424965   951014   2174569  26028379
2016-12-21  23783165  1211346   3575721  17096304
2016-12-22  26085854   972169   2802631  22176585
2016-12-23  14249484   623944   1701228  12403819
2016-12-27  18296855   789321   1397455  11763173
2016-12-28  20905892  1153824   1757500  14653348
2016-12-29  15039519   744272   1663542  10250582
2016-12-30  30586265  1769950   2952825  25579908
2017-01-03  28781865  1657268   2934299  20694101
2017-01-04  21118116  1072958   3381432  21339969
...              ...      ...       ...       ...
2017-10-09  16262923   891355   2682556  11386502
2017-10-10  15617014   968362   4032601  13944545
2017-10-11  16905640  1693274    254256  15388898
2017-10-12  16125054  1262793   3264344  16876538
2017-10-13  16394188  1169777   2506584  15335742
2017-10-16  24121452   910543   3052091  12380093
2017-10-17  18997275  1290186   6372393  16823989
2017-10-18  16374164  1057581  30490192  13300701
2017-10-19  42584166  1313575   9914169  15092758
2017-10-20  23974146  1183186   7868803  22866426
2017-10-23  21984327  1478448   5779378  20627173
2017-10-24  17757230  1212153   8194690  17517182
2017-10-25  21207098  1211262   6921137  20410808
2017-10-26  17000469  2042149   4300543  32120717
2017-10-27  44454160  5167689   4895186  71066729
2017-10-30  44700772  2085062   4210402  31756653
2017-10-31  36046828  1331391   4328258  27086575
2017-11-01  33637762  1373444   3240246  22307371
2017-11-02  41393373  1048970   3397628  23992945
2017-11-03  59398631  1076350   4431825  17633543
2017-11-06  35026306  1125185   4498871  19860852
2017-11-07  24361485  1112331   3701052  17939727
2017-11-08  24409527  1088716   4634439  18034170
2017-11-09  29482596  1245246   4776532  21178356
2017-11-10  25145500   720676   4307276  19397793
2017-11-13  16982080   885779   5107546  14196896
2017-11-14  24782487   959222   3757951  18801280
2017-11-15  29158070   853992   4773328  19383102
2017-11-16  23637484  1129688   5446453  20962750
2017-11-17  21899544  1397064   4916500  22078993

[251 rows x 4 columns]

In [46]:
#가격은 만들어진 all_data라는 딕셔너리에서 tic와 data를 돌아가면서 'Close'-아무래도 장 마감인 듯 싶다-의 데이터를 tic로 받아서 수행하며
#그러한 가격 정보에 대한 데이터 테이블을 구성해 준 것이다.
#Volume도 그와 같은 논리와 방식으로 만들어졌다.

In [47]:
returns = price.pct_change() # pct_change는 퍼센트 변화율을 의미한다.

In [42]:
returns.tail()

                AAPL      GOOG       IBM      MSFT
Date
2017-11-13 -0.004008 -0.002257 -0.005095  0.000715
2017-11-14 -0.015118  0.000244  0.003302  0.001430
2017-11-15 -0.013190 -0.004961 -0.012022 -0.012731
2017-11-16  0.011947  0.011353  0.013732  0.002651
2017-11-17 -0.005552 -0.012988 -0.001006 -0.009615

위의 테이블은 날짜별 주식의 종가로, 그 전날에 비해 어느 정도로 가격이 오르고 내리는지를 보여준다.

corr 메서드는 NA가 아니고, 정렬된 색인에서 연속하는 두 Series에 대해 상관관계를 계산하고 cov 메서드는 공분산을 계산한다.

In [48]:
returns.MSFT.corr(returns.IBM) # 가격 변화에 있어서 MSFT가 IBM과 어떤 상관관계가 있는지 확인하는 메서드

0.14517843089360252

확인 결과, 양의 상관관계이나, 상관관계의 정도가 약해 둘 사이에 어떤 상관관계가 있다고 명명하기 어렵다.

In [49]:
returns.MSFT.cov(returns.IBM)

1.3278403853014865e-05

In [50]:
returns.corr()

          AAPL      GOOG       IBM      MSFT
AAPL  1.000000  0.487923  0.025361  0.450348
GOOG  0.487923  1.000000  0.145903  0.652668
IBM   0.025361  0.145903  1.000000  0.145178
MSFT  0.450348  0.652668  0.145178  1.000000

In [51]:
returns.cov()

          AAPL      GOOG       IBM      MSFT
AAPL  0.000118  0.000051  0.000003  0.000044
GOOG  0.000051  0.000094  0.000014  0.000057
IBM   0.000003  0.000014  0.000102  0.000013
MSFT  0.000044  0.000057  0.000013  0.000082

In [53]:
returns.corrwith(returns.IBM) #corrwith 메서드를 사용하면 각 칼럼에 대해 계산한 상관관계를 담고 있는 Series를 반환한다.

AAPL    0.025361
GOOG    0.145903
IBM     1.000000
MSFT    0.145178
dtype: float64

In [56]:
returns.corrwith(volume) #시가 총액의 변화와 주가 변화율과의 상관관계를 계산함.

AAPL    0.150267
GOOG   -0.140632
IBM     0.157992
MSFT    0.148101
dtype: float64

####  5.3.2 유일 값, 값 세기, 멤버십

In [5]:
obj = Series(['c','a','d','a','a','b','b','c','c'])

In [6]:
uniques = obj.unique() #unique 메서드는 해당 배열에서 중복된 값을 제거해 유일한 값으로 처리한다.

In [7]:
uniques

array(['c', 'a', 'd', 'b'], dtype=object)

In [8]:
obj.value_counts() #value_counts() 메서드는 값 세기 메서드로, 즉, 빈도수를 계산해 반환한다.

a    3
c    3
b    2
d    1
dtype: int64

In [9]:
pd.value_counts(obj.values, sort = False)

c    3
b    2
a    3
d    1
dtype: int64

In [10]:
mask = obj.isin(['b','c']) #isin은 인자가 해당 Series 데이터에 존재하는지의 여부를 반환하는 불린 메서드이다.

In [11]:
mask

0     True
1    False
2    False
3    False
4    False
5     True
6     True
7     True
8     True
dtype: bool

In [70]:
obj[mask]

0    c
5    b
6    b
7    c
8    c
dtype: object

In [12]:
data = DataFrame({'Qu1':['1','3','4','3','4'],
                 'Qu2':['2','3','1','2','3'],
                 'Qu3':['1','5','2','4','4']})

In [13]:
data

  Qu1 Qu2 Qu3
0   1   2   1
1   3   3   5
2   4   1   2
3   3   2   4
4   4   3   4

In [16]:
result = data.apply(pd.value_counts).fillna(0) # DataFrame 형식의 데이터에는 바로 value_counts 메서드를 사용 못함.
                                               # 그래서 apply메서드를 통해 pd.value_counts를 인자로 하여 해당 과정을 수행하겠다는 의미다.
                                               # 그리고 그 결과 값에 대해서, 컬럼 당 등장하지 않는 숫자에 대해 빈도수가 0인 것으로 기록하도록
                                               # fillna()이라는 메서드를 통해 NA로 기록된 데이터에 0을 기입한다.

In [18]:
result #결과는 아래와 같다. Qu1에서 등장하는 1은 1번, 2는 0번, 3은 2번, 4는 2번, 5는 0번이다.
       #그런 식으로 Qu2와 Qu3을 해석하면 된다.

   Qu1  Qu2  Qu3
1  1.0  1.0  1.0
2  0.0  2.0  1.0
3  2.0  2.0  0.0
4  2.0  0.0  2.0
5  0.0  0.0  1.0

#### 5.4 누락된 데이터 처리하기

수집된 데이터에 누락된 값(결측치)이 존재하는 경우는 허다하다. pandas는 이 데이터를 NaN(Not a Number)로 취급해 다룰 수 있게 한다.

In [19]:
string_data = Series(['aardvark','artichoke',np.nan,'avocado'])

In [20]:
string_data

0     aardvark
1    artichoke
2          NaN
3      avocado
dtype: object

In [21]:
string_data.isnull()

0    False
1    False
2     True
3    False
dtype: bool

In [22]:
string_data[0] = None

In [25]:
string_data.isnull() #파이썬 내장 값인 None도 pandas의 NA 값으로 취급된다.

0     True
1    False
2     True
3    False
dtype: bool

#### 5.4.1 누락된 데이터 골라내기

In [26]:
#dropna 활용

In [27]:
from numpy import nan as NA

In [28]:
data = Series([1,NA,3.5,NA,7])

In [30]:
data.dropna() #dropna는 NA(결측치)를 제외한 배열을 반환하는 메서드이다.

0    1.0
2    3.5
4    7.0
dtype: float64

In [32]:
data[data.notnull()] # .notnull()과 같은 불리언 색인을 활용해서 아래와 같이 누락 데이터를 골라내는 것도 가능하다.

0    1.0
2    3.5
4    7.0
dtype: float64

In [33]:
data = DataFrame([[1., 6.5, 3.],[1.,NA,NA],[NA,NA,NA],[NA,6.5,3.]])

In [36]:
data

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [34]:
cleaned = data.dropna()

In [35]:
cleaned

     0    1    2
0  1.0  6.5  3.0

In [37]:
# 데이터 프레임에 있어 개별 로우에 NA값이 포함되어 있으면, dropna() 메서드는 NA값을 포함하고 있는 로우(레코드)를 제외한
# 온전히 데이터가 들어와 있는 로우만을 반환한다.

In [39]:
data.dropna(how='all') #메서드의 인자로 how='all'을 추가할 시, 모든 값이 NA인 로우만 제외하고 반환한다.

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
3  NaN  6.5  3.0

In [40]:
data[4]=NA

In [41]:
data

     0    1    2   4
0  1.0  6.5  3.0 NaN
1  1.0  NaN  NaN NaN
2  NaN  NaN  NaN NaN
3  NaN  6.5  3.0 NaN

In [43]:
data.dropna(axis=1,how='all') #axis=1 을 주면, 로우를 제외시키는것과 동일한 방식으로 모든 값이 NA인 칼럼을 제외한다.

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [44]:
df = DataFrame(np.random.randn(7,3))

In [45]:
df

          0         1         2
0  0.594317  0.192315 -0.569907
1 -0.341910  0.080473  1.536312
2  0.448131 -0.283739 -0.731064
3  0.613639 -0.635845 -1.267051
4 -0.156789  0.845498 -1.199734
5 -0.173185  0.724617 -0.170203
6  1.111867  1.056160  0.814881

In [46]:
df.ix[:4,1] = NA; df.ix[:2, 2] = NA

C:\ProgramData\Anaconda3\lib\site-packages\ipykernel_launcher.py:1: DeprecationWarning:
.ix is deprecated. Please use
.loc for label based indexing or
.iloc for positional indexing

See the documentation here:
http://pandas.pydata.org/pandas-docs/stable/indexing.html#deprecate_ix
  """Entry point for launching an IPython kernel.

In [47]:
df

          0         1         2
0  0.594317       NaN       NaN
1 -0.341910       NaN       NaN
2  0.448131       NaN       NaN
3  0.613639       NaN -1.267051
4 -0.156789       NaN -1.199734
5 -0.173185  0.724617 -0.170203
6  1.111867  1.056160  0.814881

In [48]:
df.dropna(thresh=3) #thresh는 해당 로우에 몇 개의 값을 포함하고 있는가에 대해, 그 수준을 지정하여 3개 이상(여기서는 가장 온전한 상태다)
                    #데이터를 포함한 로우만을 반환한다는 메서드이다.

          0         1         2
5 -0.173185  0.724617 -0.170203
6  1.111867  1.056160  0.814881

#### 5.4.2 누락된 값 채우기

누락된 값(NA)에 대해 값을 지정하기

In [49]:
df.fillna(0)

          0         1         2
0  0.594317  0.000000  0.000000
1 -0.341910  0.000000  0.000000
2  0.448131  0.000000  0.000000
3  0.613639  0.000000 -1.267051
4 -0.156789  0.000000 -1.199734
5 -0.173185  0.724617 -0.170203
6  1.111867  1.056160  0.814881

In [50]:
df.fillna({1:0.5, 3: -1}) # fillna에 사전 값을 넘겨 칼럼 별로 다른 값을 채워 넣을 수 있다.
                          # 해당 데이터에서는 1의 칼럼의 NA데이터에 0.5를, 3의 칼럼의 NA 데이터에 -1(NaN으로 나타남)을 반환하도록 한다.

          0         1         2
0  0.594317  0.500000       NaN
1 -0.341910  0.500000       NaN
2  0.448131  0.500000       NaN
3  0.613639  0.500000 -1.267051
4 -0.156789  0.500000 -1.199734
5 -0.173185  0.724617 -0.170203
6  1.111867  1.056160  0.814881

위의 메서드(fillna)는 새로운 객체를 반환하지만, 기존 객체를 변경할 수도 있다.

In [54]:
_ = df.fillna(0, inplace=True) # _는 뒤에 메서드를 적용받을 df라는 변수에 대한 재귀적 활용인 듯 싶다.
                               # fillna 메서드로 0을 지정하고, 해당 장소에 0 값을 넣으라는 inplace 인자에 True를 대입했다.

In [55]:
df

          0         1         2
0  0.594317  0.000000  0.000000
1 -0.341910  0.000000  0.000000
2  0.448131  0.000000  0.000000
3  0.613639  0.000000 -1.267051
4 -0.156789  0.000000 -1.199734
5 -0.173185  0.724617 -0.170203
6  1.111867  1.056160  0.814881

In [56]:
df = DataFrame(np.random.randn(6,3))

In [57]:
df.ix[2:,1] = NA; df.ix[4:,2] = NA

C:\ProgramData\Anaconda3\lib\site-packages\ipykernel_launcher.py:1: DeprecationWarning:
.ix is deprecated. Please use
.loc for label based indexing or
.iloc for positional indexing

See the documentation here:
http://pandas.pydata.org/pandas-docs/stable/indexing.html#deprecate_ix
  """Entry point for launching an IPython kernel.

In [58]:
df

          0         1         2
0  0.357869  0.389090  0.186781
1  0.077115  1.378886  0.923319
2 -2.284216       NaN  0.210990
3  1.454213       NaN  0.906641
4  0.442834       NaN       NaN
5 -0.034195       NaN       NaN

In [59]:
df.fillna(method='ffill') # na가 기록되기 이전 맨 마지막 값을 이후 na값이 등장하는 곳에 처음부터 채워넣겠다는 방법.

          0         1         2
0  0.357869  0.389090  0.186781
1  0.077115  1.378886  0.923319
2 -2.284216  1.378886  0.210990
3  1.454213  1.378886  0.906641
4  0.442834  1.378886  0.906641
5 -0.034195  1.378886  0.906641

In [60]:
df.fillna(method='ffill', limit = 2) #채우는 것에 한도를 두겠다는 이야기. 즉, 전방부터 등장하는 na값 2개에 대해서만
                                     #채우기로 한다는 메서드이다.

          0         1         2
0  0.357869  0.389090  0.186781
1  0.077115  1.378886  0.923319
2 -2.284216  1.378886  0.210990
3  1.454213  1.378886  0.906641
4  0.442834       NaN  0.906641
5 -0.034195       NaN  0.906641

In [61]:
#fillna를 통해 Series의 평균값과 중간 값 찾기

In [62]:
data = Series([1.,NA,3.5,NA,7])

In [64]:
data.fillna(data.mean()) #1과 3.5, 7이라는 관측치에 대해 그 평균치((1+3.5+7)/3)를 NA값으로 채워넣겠다는 이야기.

0    1.000000
1    3.833333
2    3.500000
3    3.833333
4    7.000000
dtype: float64